{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"eac992d9-29a9-43b1-b984-accddc04eaf2":{"type":"rich-text","blocks":{"template--17569847378240__eac992d9-29a9-43b1-b984-accddc04eaf2-16735056109511da6c-0":{"type":"heading","settings":{"heading":"<p>About<\/p>","heading_size":"h1"}},"template--17569847378240__eac992d9-29a9-43b1-b984-accddc04eaf2-16735056109511da6c-1":{"type":"text","settings":{"text":"<p>Chemworld Marketing Corp. started as a distribution company in 1985. Founded by multi-awarded chemist Fred C. Reyes, Chemworld initially focused on the distribution of specialty chemicals in the personal care and food industries. Chemworld quickly established its reputation as a reliable and trusted source of specialty ingredients, fragrances and flavours with major multinational and local companies in the Philippines.<br\/><br\/>Through the years, Chemworld has proven to be a pioneering innovator, constantly introducing new and exciting product concepts to the Philippine industries. Its extensive library of formularies includes the latest breakthroughs in product development in Europe, USA and Asia.<br\/><br\/>A major milestone in Chemworld's history is the opening of the first Chemworld Fragrance Factory store in 2004. It's a one-stop shop for perfumery supplies, an offshoot of its advocacy to provide livelihood opportunity to small entrepreneurs. Aside from a broad selection of perfume bottles, hundreds of the most popular fragrance oils and essential oils are available in its 20 branches (and counting) nationwide.<br\/><br\/>With its expertise and experience in the Philippine fragrance market through Chemworld Fragrance Factory, Chemworld's expansion to the air scenting business came naturally. Chemworld started offering Aeromark air scenting systems to hotels, malls, hospitals, and places of worship in 2015.<br\/><br\/>The latest air scenting equipment, stylish and eco-friendly, are adequately stocked to ensure availability of replacement in the rare cases of such need.<br\/><br\/>A great variety of high quality scents, unmatched in the industry, are available on demand. Only the best scents from sevcen major fragrance houses in Europe are screened for Aeromark application. Aeromark is the only air scenting supplier which can freely source from the world's top fragrance houses.<br\/><br\/>With its equipment guarantee and world class scent quality, Aeromark is proving to be a disruptive force in the air scenting market. In so short a time, partnership deals with major clients were sealed. Aside form being a one-stop shop for perfumery supplies, these branches of Chemworld Fragrance Factory are now available to service Aeromark clients nationwide. Air scenting oils and equipment are stored in these branches to provide immediate response for any requirement of regional and provincial accounts.<br\/><br\/>Aside from being a one-stop shop for perfumery supplies, these branches of Chemworld Fragrance Factory are now available to service Aeromark clients nationwide. Air scenting oils and equipment are stored in these branches to provide immediate response for any requirement of regional and provincial accounts.<\/p>"}},"template--17569847378240__eac992d9-29a9-43b1-b984-accddc04eaf2-16735056109511da6c-2":{"type":"button","disabled":true,"settings":{"button_label":"Button label","button_link":"","button_style_secondary":false,"button_label_2":"","button_link_2":"","button_style_secondary_2":false}}},"block_order":["template--17569847378240__eac992d9-29a9-43b1-b984-accddc04eaf2-16735056109511da6c-0","template--17569847378240__eac992d9-29a9-43b1-b984-accddc04eaf2-16735056109511da6c-1","template--17569847378240__eac992d9-29a9-43b1-b984-accddc04eaf2-16735056109511da6c-2"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"background-1","full_width":true,"padding_top":40,"padding_bottom":52}},"ab3f0f09-1971-4e8d-91e1-988a009de078":{"type":"custom-liquid","settings":{"custom_liquid":"{% style %}\n.rich-text__blocks.center .rich-text__text.rte p {\n text-align: justify;\n}\n\n{% endstyle %}","color_scheme":"background-1","padding_top":0,"padding_bottom":0}}},"order":["main","eac992d9-29a9-43b1-b984-accddc04eaf2","ab3f0f09-1971-4e8d-91e1-988a009de078"]}